docs/APPLIKASJONSDOKUMENTASJON.md
```mermaid
stateDiagram
    [*] --> MottattType
    MottattType --> AvventerJournalpostType
    AvventerJournalpostType --> AvventerPersondataType
    AvventerPersondataType --> KategoriseringType
    KategoriseringType --> AvventerSøknadsdataType
    AvventerSøknadsdataType --> HåndterInnsendingType
    HåndterInnsendingType --> AventerArenaStartVedtakType
    HåndterInnsendingType --> AvventerFerdigstillJournalpostType
    AventerArenaStartVedtakType --> AvventerFerdigstillJournalpostType
    AvventerFerdigstillJournalpostType --> InnsendingFerdigstiltType
    InnsendingFerdigstiltType --> [*]
```
